netsuite/netsuite-connector/netsuite-connector-1.0.0/org.wso2.carbon.connector/src/test/resources/artifacts/ESB/config/soapRequests/netsuite/api_detach_mandatory.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:messages_2014_1.platform.webservices.netsuite.com" xmlns:urn1="urn:core_2014_1.platform.webservices.netsuite.com" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
   <soapenv:Header>
      <urn:preferences>
         <urn:warningAsError/>
         <urn:disableMandatoryCustomFieldValidation/>
         <urn:disableSystemNotesForCustomFields/>
         <urn:ignoreReadOnlyFields/>
      </urn:preferences>
      <urn:partnerInfo>
         <urn:partnerId/>
      </urn:partnerInfo>
      <urn:applicationInfo>
         <urn:applicationId/>
      </urn:applicationInfo>
      <urn:passport>
         <urn:email>%s(email)</urn:email>
         <urn:password>%s(password)</urn:password>
         <urn:account>%s(account)</urn:account>
         <urn1:role>
            <urn1:name/>
         </urn1:role>
      </urn:passport>
   </soapenv:Header>
   <soapenv:Body>
      <detach xmlns="urn:core_2014_1.platform.webservices.netsuite.com">
         <urn:detachReference  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"  xsi:type="ns1:DetachBasicReference" xmlns:ns1="urn:core_2014_1.platform.webservices.netsuite.com">
            <ns1:detachFrom internalId="%s(attachCustomerInternalId)" type="customer" xsi:type="ns1:RecordRef">
            </ns1:detachFrom>
             <ns1:detachedRecord internalId="%s(attachContactInternalId)" type="contact" xsi:type="ns1:RecordRef"/>   
    </urn:detachReference>
      </detach>
   </soapenv:Body>
</soapenv:Envelope>
